Autodesk.Revit.DB.ColorOptions.EditingColor
The color used to render elements when editing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.CalculatingColor
The color used to render elements when some aspect of their properties is currently being recalculated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.AlertColor
The color used to highlight elements when a special alert is required.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.PreselectionColor
The color used to highlight candidates for selection before they are selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.SelectionSemitransparent
Indicates whether or not selections will be shown in a semi-transparent manner.
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.SelectionColor
The color used to highlight selected elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.BackgroundColor
The background color applied to views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1